In [2]:
import pandas as pd
from tabulate import tabulate
df_1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],'Name': ['Dog', 'Cat', 'Eagle', 'Peacock']})
print(df_1)
df_2 = pd.DataFrame({'id' : ['A01', 'A06', 'A02', 'A07'],'City': ['SFO', 'Chennai', 'NYC', 'Bangalore'],'Age': ['12', '13', '14', '12']})
print(df_2)

    id     Name
0  A01      Dog
1  A02      Cat
2  A03    Eagle
3  A04  Peacock
    id       City Age
0  A01        SFO  12
1  A06    Chennai  13
2  A02        NYC  14
3  A07  Bangalore  12

In [3]:
def pretty_print(title,df,n):
  print(f"\n{title}")
  print(tabulate(df.head(n),headers="keys",tablefmt="psql"))
pretty_print("df1",df_1,10)
pretty_print("df2",df_2,10)

df1
+----+------+---------+
|    | id   | Name    |
|----+------+---------|
|  0 | A01  | Dog     |
|  1 | A02  | Cat     |
|  2 | A03  | Eagle   |
|  3 | A04  | Peacock |
+----+------+---------+

df2
+----+------+-----------+-------+
|    | id   | City      |   Age |
|----+------+-----------+-------|
|  0 | A01  | SFO       |    12 |
|  1 | A06  | Chennai   |    13 |
|  2 | A02  | NYC       |    14 |
|  3 | A07  | Bangalore |    12 |
+----+------+-----------+-------+

### **Merge**
dataframe_1.merge(dataframe_2,on='common_column',how='left'/'outer'/'inner')

Outer->gives all rows from both dataframes

In [4]:
df_outer=df_1.merge(df_2,on='id',how='outer')
print(df_outer)
pretty_print("merged outer:",df_outer,10)

    id     Name       City  Age
0  A01      Dog        SFO   12
1  A02      Cat        NYC   14
2  A03    Eagle        NaN  NaN
3  A04  Peacock        NaN  NaN
4  A06      NaN    Chennai   13
5  A07      NaN  Bangalore   12

merged outer:
+----+------+---------+-----------+-------+
|    | id   | Name    | City      |   Age |
|----+------+---------+-----------+-------|
|  0 | A01  | Dog     | SFO       |    12 |
|  1 | A02  | Cat     | NYC       |    14 |
|  2 | A03  | Eagle   | nan       |   nan |
|  3 | A04  | Peacock | nan       |   nan |
|  4 | A06  | nan     | Chennai   |    13 |
|  5 | A07  | nan     | Bangalore |    12 |
+----+------+---------+-----------+-------+

inner->gives common rows from both data frames

In [5]:
df_inner = pd.merge(df_1, df_2, on='id', how='inner')
pretty_print("merged inner:", df_inner, 10)

merged inner:
+----+------+--------+--------+-------+
|    | id   | Name   | City   |   Age |
|----+------+--------+--------+-------|
|  0 | A01  | Dog    | SFO    |    12 |
|  1 | A02  | Cat    | NYC    |    14 |
+----+------+--------+--------+-------+

In [11]:
#takes all the values from df1, if it exists on the df2
#puts it values, otherwise nan
df_left=df_1.merge(df_2,on='id',how='left')

pretty_print("merged inner:",df_left,10)

merged inner:
+----+------+---------+--------+-------+
|    | id   | Name    | City   |   Age |
|----+------+---------+--------+-------|
|  0 | A01  | Dog     | SFO    |    12 |
|  1 | A02  | Cat     | NYC    |    14 |
|  2 | A03  | Eagle   | nan    |   nan |
|  3 | A04  | Peacock | nan    |   nan |
+----+------+---------+--------+-------+

# **find rows in df2 which are not in df1**

In [16]:
df_new=df_left[df_left["City"].isna()]
print(df_new)

    id     Name City  Age
2  A03    Eagle  NaN  NaN
3  A04  Peacock  NaN  NaN

In [9]:
#takes all the values from df2, if it exists on the df1
#puts it values, otherwise nan
df_right=df_1.merge(df_2,on='id',how='right')

pretty_print("merged inner:",df_right,10)

merged inner:
+----+------+--------+-----------+-------+
|    | id   | Name   | City      |   Age |
|----+------+--------+-----------+-------|
|  0 | A01  | Dog    | SFO       |    12 |
|  1 | A06  | nan    | Chennai   |    13 |
|  2 | A02  | Cat    | NYC       |    14 |
|  3 | A07  | nan    | Bangalore |    12 |
+----+------+--------+-----------+-------+